20230826063851-systems_administration.org
:PROPERTIES:
:ID:       e29f43d3-c62a-4261-b04e-07b8b453dcf0
:END:
#+title: Systems Administration

* Hardware Provisioning
1. Procurement
2. Deployment
3. Maintenance
4. Retirement


* Administrative rights
When using administrative rights:
1. Respect the privacy of others
2. Think before you type
3. With great power, comes great responsibility.


* Troubleshooting
[[id:bd01f427-c426-42d2-980c-65302b373861][Reproduction Case]]

* [[id:68e2fd15-662f-4b92-851f-f25813f76cbe][Types of IT Infrastructure]]

* User control
[[id:e53799e0-70cc-41e8-ad7d-7610938f662c][Directory Services]]

* [[id:a4641f6e-7487-4cda-831e-90a869bf1a96][File Sharing]]

** Managing services
*** [[id:45bb23df-e29d-46dc-b704-f17cf26af1d7][Windows]]
=Get-Service wuauserv=
i.e. =Get-Service wuauserv | Format-List *=

=Stop-Service wuauserv=
=Start-Service wuauserv=

Or GUI via Services Management Console

*** [[id:5c6ee0bf-4232-4ea7-8117-cfd39937a099][Linux]]
=service ntp status=
=service ntp start=
=service ntp restart=

** Configuring Services
[[id:8d6e407a-3611-4c55-9b80-aa8587b4cfa7][Centralized Management]]
*** [[id:45bb23df-e29d-46dc-b704-f17cf26af1d7][Windows]]

*** [[id:5c6ee0bf-4232-4ea7-8117-cfd39937a099][Linux]]
Directory: =/etc/=
Configuration File: =/etc/*.conf=

[[id:f9926c12-8dc4-4509-8758-7139ce355eca][Software Services]]
[[id:eaf3c0fe-ba33-4cdc-8201-b7ea6ee4809b][Platform Services]]
