20230826063851-systems_administration.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 10:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Systems Administration</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Systems Administration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfdd5259">1. Hardware Provisioning</a></li>
<li><a href="#orga03b1b5">2. Administrative rights</a></li>
<li><a href="#orge863088">3. Troubleshooting</a></li>
<li><a href="#org436345f">4. Types of IT Infrastructure</a></li>
<li><a href="#orgee95cb3">5. User control</a></li>
<li><a href="#org14c1d1f">6. File Sharing</a>
<ul>
<li><a href="#orgddf8329">6.1. Managing services</a>
<ul>
<li><a href="#org89808e4">6.1.1. Windows</a></li>
<li><a href="#org3ee1cb8">6.1.2. Linux</a></li>
</ul>
</li>
<li><a href="#org859452e">6.2. Configuring Services</a>
<ul>
<li><a href="#org9206f2b">6.2.1. Windows</a></li>
<li><a href="#orgc019a83">6.2.2. Linux</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfdd5259" class="outline-2">
<h2 id="orgfdd5259"><span class="section-number-2">1.</span> Hardware Provisioning</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Procurement</li>
<li>Deployment</li>
<li>Maintenance</li>
<li>Retirement</li>
</ol>
</div>
</div>


<div id="outline-container-orga03b1b5" class="outline-2">
<h2 id="orga03b1b5"><span class="section-number-2">2.</span> Administrative rights</h2>
<div class="outline-text-2" id="text-2">
<p>
When using administrative rights:
</p>
<ol class="org-ol">
<li>Respect the privacy of others</li>
<li>Think before you type</li>
<li>With great power, comes great responsibility.</li>
</ol>
</div>
</div>


<div id="outline-container-orge863088" class="outline-2">
<h2 id="orge863088"><span class="section-number-2">3.</span> Troubleshooting</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="20230826065938-reproduction_case.html#ID-bd01f427-c426-42d2-980c-65302b373861">Reproduction Case</a>
</p>
</div>
</div>

<div id="outline-container-org436345f" class="outline-2">
<h2 id="org436345f"><span class="section-number-2">4.</span> <a href="20230826071045-types_of_it_infrastructure.html#ID-68e2fd15-662f-4b92-851f-f25813f76cbe">Types of IT Infrastructure</a></h2>
</div>

<div id="outline-container-orgee95cb3" class="outline-2">
<h2 id="orgee95cb3"><span class="section-number-2">5.</span> User control</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="20230826072244-directory_services.html#ID-e53799e0-70cc-41e8-ad7d-7610938f662c">Directory Services</a>
</p>
</div>
</div>

<div id="outline-container-org14c1d1f" class="outline-2">
<h2 id="org14c1d1f"><span class="section-number-2">6.</span> <a href="20230826073535-file_sharing.html#ID-a4641f6e-7487-4cda-831e-90a869bf1a96">File Sharing</a></h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgddf8329" class="outline-3">
<h3 id="orgddf8329"><span class="section-number-3">6.1.</span> Managing services</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org89808e4" class="outline-4">
<h4 id="org89808e4"><span class="section-number-4">6.1.1.</span> <a href="20230819062442-windows.html#ID-45bb23df-e29d-46dc-b704-f17cf26af1d7">Windows</a></h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
<code>Get-Service wuauserv</code>
i.e. <code>Get-Service wuauserv | Format-List *</code>
</p>

<p>
<code>Stop-Service wuauserv</code>
<code>Start-Service wuauserv</code>
</p>

<p>
Or GUI via Services Management Console
</p>
</div>
</div>

<div id="outline-container-org3ee1cb8" class="outline-4">
<h4 id="org3ee1cb8"><span class="section-number-4">6.1.2.</span> <a href="20230820050746-linux.html#ID-5c6ee0bf-4232-4ea7-8117-cfd39937a099">Linux</a></h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
<code>service ntp status</code>
<code>service ntp start</code>
<code>service ntp restart</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org859452e" class="outline-3">
<h3 id="org859452e"><span class="section-number-3">6.2.</span> Configuring Services</h3>
<div class="outline-text-3" id="text-6-2">
<p>
<a href="20230828190643-centralized_management.html#ID-8d6e407a-3611-4c55-9b80-aa8587b4cfa7">Centralized Management</a>
</p>
</div>
<div id="outline-container-org9206f2b" class="outline-4">
<h4 id="org9206f2b"><span class="section-number-4">6.2.1.</span> <a href="20230819062442-windows.html#ID-45bb23df-e29d-46dc-b704-f17cf26af1d7">Windows</a></h4>
</div>

<div id="outline-container-orgc019a83" class="outline-4">
<h4 id="orgc019a83"><span class="section-number-4">6.2.2.</span> <a href="20230820050746-linux.html#ID-5c6ee0bf-4232-4ea7-8117-cfd39937a099">Linux</a></h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
Directory: <code>/etc/</code>
Configuration File: <code>/etc/*.conf</code>
</p>

<p>
<a href="20230826084622-software_services.html#ID-f9926c12-8dc4-4509-8758-7139ce355eca">Software Services</a>
<a href="20230826084629-platform_services.html#ID-eaf3c0fe-ba33-4cdc-8201-b7ea6ee4809b">Platform Services</a>
</p>

<p>
<a href="20230829065841-data_recovery.html#ID-83cebd61-b292-46cb-95b3-e50c900ff7cc">Data Recovery</a>
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
